---
kind: other
id: Methods.T:Autodesk.Revit.Exceptions.ApplicationException
source: html/6af3ce5e-20db-6f2b-05ce-db04946bd7c3.htm
---
# ApplicationException Methods

Retrieves data needed to serialize the target object.